In [57]:
import pandas as pd

In [58]:
df=pd.read_csv("user_data.csv")

In [59]:
df

,Name,Age,City,Gender,Email,Join Date
0,William Martinez,30.0,Jacksonville,F,william.martinez@test.org,29-09-2022
1,Barbara Martinez,47.0,Washington,NaN,NaN,16-01-2023
2,Thomas Johnson,46.0,Phoenix,F,thomas.johnson@example.com,13-10-2020
3,Sarah Gonzalez,42.0,Charlotte,M,sarah.gonzalez@example.com,13-05-2019
4,Karen Johnson,48.0,NaN,F,karen.johnson@mail.com,04-03-2022
...,...,...,...,...,...,...
95,Linda Thomas,62.0,New York,F,NaN,NaN
96,Karen Brown,38.0,Chicago,F,karen.brown@test.org,30-09-2023
97,Charles Jones,51.0,Seattle,M,charles.jones@mail.com,02-07-2020
98,Robert Hernandez,52.0,Houston,M,robert.hernandez@example.com,08-03-2020
99,Mary Rodriguez,50.0,Indianapolis,M,mary.rodriguez@test.org,10-08-2018

In [60]:
df.isnull().sum()

Name          0
Age          11
City          7
Gender        7
Email        14
Join Date    11
dtype: int64

In [61]:
df['Age'].fillna(df['Age'].mean(),inplace=True)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_12112\694922604.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace=True)

In [62]:
df.isnull().sum()

Name          0
Age           0
City          7
Gender        7
Email        14
Join Date    11
dtype: int64

In [63]:
df["City"].fillna("N/A",inplace=True)
df['Email'].fillna("N/A",inplace=True)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_12112\547464868.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["City"].fillna("N/A",inplace=True)
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_12112\547464868.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Email'].fillna("N/A",inplace=True)

In [64]:
df.isnull().sum()

Name          0
Age           0
City          0
Gender        7
Email         0
Join Date    11
dtype: int64

In [65]:
df.duplicated().sum()

8

In [66]:
df.drop_duplicates(inplace=True)

In [67]:
df.duplicated().sum()

0

In [68]:
   # remove extra spaces
df["Gender"] = df["Gender"].replace({"F":"Female","M":"Male"})

In [69]:
df['Gender']

0     Female
1        NaN
2     Female
3       Male
4     Female
       ...
95    Female
96    Female
97      Male
98      Male
99      Male
Name: Gender, Length: 92, dtype: object